# 参数设置
nc: 80  # 类别数
scales: # 模型缩放
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone with SPD-Conv
backbone:
  # [from, repeats, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2

   [-1, 1, Conv, [128, 3, 1]], # 2-P2/4 非步长卷积
   [-1, 1, SPD, [1]],         # 1 空间到深度转换
   [-1, 3, C2f, [128, True]], # 3

   [-1, 1, Conv, [256, 3, 1]], # 5-P3/8 非步长卷积
   [-1, 1, SPD, [1]],         # 4 空间到深度转换
   [-1, 6, C2f, [256, True]], # 6

   [-1, 1, Conv, [512, 3, 1]], # 8-P4/16 非步长卷积
   [-1, 1, SPD, [1]],         # 7 空间到深度转换
   [-1, 6, C2f, [512, True]], # 9

   [-1, 1, Conv, [1024, 3, 1]], # 11-P5/32 非步长卷积
   [-1, 1, SPD, [1]],          # 10 空间到深度转换
   [-1, 3, C2f, [1024, True]], # 12
   [-1, 1, SPPF, [1024, 5]]  # 13
  ]

# YOLOv8 head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']], # 14 上采样
   [[-1, 9], 1, Concat, [1]],  # 15 concat backbone P4
   [-1, 3, C2f, [512]], # 16

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 17 上采样
   [[-1, 6], 1, Concat, [1]], # 18 concat backbone P3
   [-1, 3, C2f, [256]], # 19 (P3/8-small)

   [-1, 1, Conv, [256, 3, 1]], # 21 非步长卷积
   [[-1, 16], 1, Concat, [1]], # 22 concat head P4
   [-1, 3, C2f, [512]], # 23 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 1]], # 25 非步长卷积
   [[-1, 13], 1, Concat, [1]], # 26 concat head P5
   [-1, 3, C2f, [1024]], # 27 (P5/32-large)

   [[19, 22, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
  ]
